package utils_test

import (
	"bytes"
	"strings"
	"testing"

	"github.com/AkimioJR/MediaWarp/utils"
)

var subtitle1 = `
1
00:00:05,510 --> 00:00:07,100
好痛…

2
00:00:07,630 --> 00:00:08,800
好痛…

3
00:00:14,440 --> 00:00:17,360
救救我…好冷…

4
00:00:23,800 --> 00:00:26,410
不要…我不要…

5
00:00:32,760 --> 00:00:34,500
可惡 可惡

6
00:00:36,390 --> 00:00:37,420
媽媽？

7
00:00:41,230 --> 00:00:41,990
媽…

8
00:00:51,180 --> 00:00:51,850
又是這個夢

9
00:00:52,490 --> 00:00:53,520
你醒了？

10
00:00:54,960 --> 00:00:56,290
你怎麼在這？

11
00:00:58,440 --> 00:01:00,900
別擺出這副嚇人的表情嘛

12
00:01:03,570 --> 00:01:07,340
我可是給你帶來了一張…一夜暴富的車票哦

13
00:01:09,300 --> 00:01:12,770
別礙事 你這美人計對我沒用

14
00:01:12,900 --> 00:01:14,700
真是的 裝什麼老成

15
00:01:16,170 --> 00:01:18,420
這次肯定不會有錯

16
00:01:18,940 --> 00:01:22,960
值得信賴的人說了在用 我才買下來的

17
00:01:23,110 --> 00:01:25,490
你都被這種說辭騙過多少次了

18
00:01:29,400 --> 00:01:31,610
活得這麼馬虎 小心最後不得善終

19
00:01:31,710 --> 00:01:33,530
別廢話了 你就試試吧

20
00:01:33,960 --> 00:01:35,500
說不定 說不定呢

21
00:01:36,090 --> 00:01:36,630
接著

22
00:01:39,310 --> 00:01:42,250
至今為止這個倒算是最看得過去的了

23
00:01:42,300 --> 00:01:43,590
對吧

24
00:01:46,050 --> 00:01:47,700
姑且先試試吧

25
00:01:52,440 --> 00:01:54,630
反正也沒別的事可做了

26
00:01:59,170 --> 00:02:00,500
在這樣的世界裡

27
00:02:14,310 --> 00:02:14,570
備受期待的全新大規模能源資源

28
00:02:14,570 --> 00:02:17,670
(日誌 01 前往海之搖籃)
備受期待的全新大規模能源資源

29
00:02:17,670 --> 00:02:17,810
(日誌 01 前往海之搖籃)

30
00:02:17,810 --> 00:02:19,280
天照計劃
(日誌 01 前往海之搖籃)

31
00:02:19,280 --> 00:02:19,290
天照計劃

32
00:02:19,780 --> 00:02:24,840
其第一階段內容是籌劃已久的火箭發射項目

33
00:02:24,840 --> 00:02:26,920
市民的反對呼聲仍舊高漲…

34
00:02:27,220 --> 00:02:29,200
這次能發射出去嗎

35
00:02:29,520 --> 00:02:30,200
肯定能

36
00:02:31,150 --> 00:02:34,390
可是 有那個放煙花的閒錢

37
00:02:34,630 --> 00:02:38,110
還不如拿來改善我們老百姓的生活吧

38
00:02:39,140 --> 00:02:41,560
撐得了一時撐不了一世

39
00:02:42,340 --> 00:02:43,740
必須得開創未來

40
00:02:44,320 --> 00:02:46,460
話說回來 這真是塊破銅爛鐵

41
00:02:46,650 --> 00:02:48,570
真能靠它潛下去嗎

42
00:02:48,700 --> 00:02:50,700
不是大嬸你讓我去潛水的嗎

43
00:02:50,790 --> 00:02:51,930
叫我凱瑟琳

44
00:02:52,190 --> 00:02:54,630
再叫大嬸就把你沉到海底去

45
00:02:55,120 --> 00:02:57,510
說到底「凱瑟琳」不也是化名嗎

46
00:02:57,840 --> 00:02:59,090
跟大嬸有啥區別

47
00:02:59,090 --> 00:03:02,820
少廢話 每個人都有難言之隱的

48
00:03:02,830 --> 00:03:05,070
小夏

49
00:03:09,740 --> 00:03:11,960
小夏 一起去上學吧

50
00:03:14,280 --> 00:03:15,290
人家在叫你呢

51
00:03:15,700 --> 00:03:17,620
不用管 她遲早會放棄的

52
00:03:18,080 --> 00:03:21,520
被甩了呢 學會放棄也是戀愛的必修課哦

53
00:03:22,070 --> 00:03:24,060
才 才不是那樣呢

54
00:03:27,410 --> 00:03:30,360
我還以為你終於不再陰魂不散了呢

55
00:03:30,700 --> 00:03:33,120
別把我說得像個瘟神一樣

56
00:03:33,690 --> 00:03:37,140
我可是這位斑鳩夏生的合伙人(partner)呢

57
00:03:38,040 --> 00:03:39,100
伴侶？

58
00:03:39,880 --> 00:03:41,310
別胡說八道了

59
00:03:41,590 --> 00:03:43,950
你不就是個滿口可疑點子的騙子嗎

60
00:03:43,950 --> 00:03:45,280
哪裡可疑了

61
00:03:45,580 --> 00:03:49,840
你祖母家裡沉眠著寶藏這個消息是絕對不會有錯的

62
00:03:50,180 --> 00:03:51,830
小夏的祖母？

63
00:03:52,180 --> 00:03:54,110
是那位什麼學家嗎

64
00:03:54,460 --> 00:03:57,330
海洋地質學博士 八千草乃音子

65
00:03:57,900 --> 00:04:00,300
她要我去找沉眠在祖母家的寶藏

66
00:04:00,540 --> 00:04:03,960
靠這個去撿回來 再跟她對半分

67
00:04:04,530 --> 00:04:06,110
好 好可疑…

68
00:04:06,110 --> 00:04:07,010
你們好煩

69
00:04:07,460 --> 00:04:08,840
所以呢 搞好了嗎

70
00:04:09,330 --> 00:04:12,760
嗯 前提是剛才那個零件沒問題

71
00:04:13,760 --> 00:04:15,100
真的嗎

72
00:04:15,590 --> 00:04:18,260
等 等等 你要坐這個潛到海裡去？

73
00:04:18,780 --> 00:04:19,280
對啊

74
00:04:19,440 --> 00:04:23,350
還是算了吧 要珍惜生命呀
`
var subtitle2 = `
1
00:00:48,422 --> 00:00:53,177
Once upon a time there was a lovely princess.

2
00:00:53,427 --> 00:01:02,019
But she had an enchantment upon her of a fearful sort,
which could only be broken by Love's first kiss.

3
00:01:02,270 --> 00:01:08,609
She was locked away in a castle guarded by a terrible
fire breathing dragon.

4
00:01:08,860 --> 00:01:15,992
Many brave knights had attempted to free her from
this dreadful prison, but none prevailed.

5
00:01:16,242 --> 00:01:23,040
She waited in the dragon's keep in the highest
room of the tallest tower for her true love

6
00:01:23,291 --> 00:01:27,253
and true love's first kiss.

7
00:01:27,503 --> 00:01:29,714
Like that's ever going to happen.

8
00:01:29,964 --> 00:01:34,552
What a loony.

9
00:01:51,485 --> 00:01:57,658
Shrek
`
var subtitle3 = `
33
00:02:24,840 --> 00:02:26,920
市民的反對呼聲仍舊高漲…

34
00:02:27,220 --> 00:02:29,200
這次能發射出去嗎

35
00:02:29,520 --> 00:02:30,200
肯定能

36
00:02:31,150 --> 00:02:34,390
可是 有那個放煙花的閒錢
`
var subtitle4 = `
1
100:00:01,000 --> 00:00:04,000
字幕示例

2
00:00:05,000 --> 00:00:08,000
第二行字幕示例`

type TestCase struct {
	Text   string
	Result bool
}

var testCases = map[string]TestCase{
	"字幕1": {subtitle1, true},
	"字幕2": {subtitle2, true},
	"字幕3": {subtitle3, true},
	"字幕4": {subtitle4, true},
}

func TestIsSrt(t *testing.T) {

	for caseName, testCase := range testCases {
		t.Run(caseName, func(t *testing.T) {
			result := utils.IsSRT([]byte(testCase.Text))
			if testCase.Result != result {
				t.Errorf("%s 解析错误。期望: %t, 实际: %t", caseName, testCase.Result, result)
			}
		})
	}
}

func BenchmarkIsSrt(b *testing.B) {
	for i := 0; i < b.N; i++ {
		for _, testCase := range testCases {
			utils.IsSRT([]byte(testCase.Text))
		}
	}
}

func TestSRT2ASS(t *testing.T) {
	var (
		srt = `1
00:00:00,490 --> 00:00:02,290
金伯利魔法學校
(金伯利魔法學校)

2
00:00:02,290 --> 00:00:02,410
(金伯利魔法學校)

3
00:00:03,040 --> 00:00:03,480
(20%的學生)

4
00:00:03,480 --> 00:00:05,310
在畢業之前
(20%的學生)

5
00:00:05,540 --> 00:00:05,800
(無法活著)

6
00:00:05,800 --> 00:00:07,480
有兩成學生
(無法活著)

7
00:00:08,500 --> 00:00:09,340
(從這裡畢業)

8
00:00:09,340 --> 00:00:10,850
會為魔所噬
(從這裡畢業)

9
00:00:10,850 --> 00:00:11,960
(從這裡畢業)

10
00:00:20,210 --> 00:00:22,710
連「不開花的傑克」都綻放得如此美麗

11
00:00:24,230 --> 00:00:26,720
哎呀呀 這位學生

12
00:00:26,720 --> 00:00:29,080
你非常緊張啊

13
00:00:29,500 --> 00:00:30,720
我看起來很緊張嗎

14
00:00:30,720 --> 00:00:33,890
是的 你大可以放鬆點

15
00:00:33,890 --> 00:00:36,320
畢竟今天是開學典禮

16
00:00:36,610 --> 00:00:40,390
無論你將走向多麼恐怖的未來

17
00:00:40,970 --> 00:00:42,710
謝謝關心 夫人

18
00:00:45,530 --> 00:00:47,320
恐怖的未來啊

19
00:00:47,830 --> 00:00:51,310
估計每個新生都會受到同樣的警告吧

20
00:00:52,020 --> 00:00:55,090
然而最麻煩的是 這話並非信口開河

21
00:00:55,720 --> 00:00:58,410
因為我即將就讀的學校…

22
00:01:01,850 --> 00:01:04,000
嚇死我了

23
00:01:04,280 --> 00:01:07,730
恐怖的未來 究竟是怎樣的啊

24
00:01:08,900 --> 00:01:11,660
桀驁植物說的話別往心裡去

25
00:01:12,730 --> 00:01:17,630
那類魔法植物的性格 跟土壤中的魔素性質有關

26
00:01:18,050 --> 00:01:20,820
據說這裡性格惡劣的尤其多

27
00:01:20,820 --> 00:01:24,870
這樣啊 我不太熟悉植物

28
00:01:24,870 --> 00:01:26,830
但還挺喜歡魔法生物的

29
00:01:26,830 --> 00:01:29,240
哦？你喜歡什麼呢

30
00:01:29,240 --> 00:01:30,910
什麼都喜歡

31
00:01:30,910 --> 00:01:33,610
小的喜歡 大的也喜歡

32
00:01:33,610 --> 00:01:35,090
扭來扭去的也喜歡

33
00:01:35,090 --> 00:01:37,490
扭來扭去？那是什麼啊

34
00:01:37,490 --> 00:01:40,220
這位同學 喊你呢

35
00:01:41,000 --> 00:01:42,050
喊我？

36
00:01:42,050 --> 00:01:45,220
請多加注意

37
00:01:45,930 --> 00:01:49,470
你差點踩到夫人的莖了

38
00:01:49,470 --> 00:01:52,170
小心被罵得狗血淋頭

39
00:01:52,170 --> 00:01:53,910
真沒禮貌

40
00:01:57,710 --> 00:02:00,620
別管我 我又不在乎

41
00:02:01,770 --> 00:02:05,940
哎呀呀 你這身穿著還真稀奇啊

42
00:02:06,790 --> 00:02:08,940
我說 那人莫非…

43
00:02:08,940 --> 00:02:10,590
是武士嗎

44
00:02:10,590 --> 00:02:12,600
嗯 是武士吧

45
00:02:12,600 --> 00:02:14,670
我還是頭一次見到

46
00:02:15,420 --> 00:02:19,130
那位少女為何如此吸引我

47
00:02:19,750 --> 00:02:22,690
是因為異國裝扮太過稀奇嗎

48
00:02:23,020 --> 00:02:24,000
還是說…

49
00:02:31,020 --> 00:02:33,840
也許是我內心產生了某種感覺

50
00:02:34,820 --> 00:02:37,330
它就像是種預感

51
00:02:38,440 --> 00:02:40,190
人們常稱之為命運

52
00:02:49,850 --> 00:02:52,380
是魔法生物遊行

53
00:03:00,000 --> 00:03:01,750
不愧是金伯利

54
00:03:01,750 --> 00:03:04,760
看完植物 又給我們看動物

55
00:03:04,760 --> 00:03:06,700
我還是第一次見那種龍

56
00:03:06,700 --> 00:03:08,000
你認識嗎

57
00:03:08,000 --> 00:03:10,610
嗯 那是法夫納吧

58
00:03:10,610 --> 00:03:12,760
其他龍的鱗片可沒這麼氣派

59
00:03:12,760 --> 00:03:15,180
哦？你挺熟的嘛

60
00:03:15,180 --> 00:03:18,620
也不算啦 我只是看過圖鑑 略知一二

61
00:03:20,790 --> 00:03:24,030
怎麼了 你不是喜歡魔法生物嗎

62
00:03:26,280 --> 00:03:28,650
我是喜歡 但是…

63
00:03:29,580 --> 00:03:30,340
你們看

64
00:03:30,970 --> 00:03:34,290
洞穴巨人跟其他魔獸一樣 也被牽出來遊行了

65
00:03:34,610 --> 00:03:36,870
怎麼能做這種事呢

66
00:03:38,040 --> 00:03:40,470
你說什麼呢 那可是洞穴巨人

67
00:03:40,470 --> 00:03:43,890
聽不懂人話 野生的還會襲擊人類

68
00:03:44,160 --> 00:03:46,520
將其馴服 為人類所用是理所當然的吧

69
00:03:46,520 --> 00:03:49,160
那是因為人類侵犯了他們的領地啊

70
00:03:49,160 --> 00:03:51,490
他們其實是心地善良的生物

71
00:03:51,490 --> 00:03:55,200
在我鄉下老家 田地每年都會被那玩意糟蹋

72
00:03:55,200 --> 00:03:56,940
我們的領地被侵犯就是活該囉

73
00:03:56,940 --> 00:03:59,530
那些田地歸根結底也是他們的棲息地

74
00:03:59,530 --> 00:04:01,730
喂 能不能安靜點

75
00:04:03,250 --> 00:04:04,630
打擾我看書了

76
00:04:05,190 --> 00:04:06,540
對不起

77
00:04:06,540 --> 00:04:07,530
抱歉

78
00:04:07,910 --> 00:04:09,130
知錯就好

79
00:04:11,480 --> 00:04:15,810
那是獅鷲嗎 翅膀跟插畫不一樣

80
00:04:16,680 --> 00:04:19,460
你們的心情我理解 但還是晚點再爭吧

81
00:04:19,460 --> 00:04:21,330
好歹先自我介紹一下

82
00:04:23,120 --> 00:04:25,290
也…也對

83
00:04:26,090 --> 00:04:27,670
我叫…

84
00:04:27,950 --> 00:04:28,960
「蹬地疾馳」

85
00:04:39,850 --> 00:04:41,200
喂 你幹什麼呢

86
00:04:41,200 --> 00:04:43,620
停下來 不能再接近遊行了

87
00:04:43,620 --> 00:04:44,740
我知道

88
00:04:44,740 --> 00:04:46,500
但我的腿不聽使喚

89
00:04:46,500 --> 00:04:47,510
是魔法嗎

90
00:04:49,640 --> 00:04:51,030
出什麼事了

91
00:04:51,890 --> 00:04:53,990
我也不清楚

92
00:04:53,990 --> 00:04:55,080
糟糕了

93
00:04:55,450 --> 00:04:57,480
那個洞穴巨人 在向她走去

94
00:05:00,260 --> 00:05:02,630
到底搞什麼啊 受不了

95
00:05:02,880 --> 00:05:04,380
喂 出什麼事了

96
00:05:04,380 --> 00:05:06,920
餘興節目…也不像啊

97
00:05:12,610 --> 00:05:14,000
怎…怎麼會

98
00:05:14,850 --> 00:05:15,840
糟了

99
00:05:21,640 --> 00:05:22,550
好疼

100
00:05:28,090 --> 00:05:30,630
這樣根本來不及

101
00:05:34,540 --> 00:05:37,450
喝

102
00:05:45,130 --> 00:05:46,670
還能跑嗎

103
00:05:47,800 --> 00:05:48,820
好疼

104
00:05:49,420 --> 00:05:51,530
不行 腿受傷了

105
00:05:51,840 --> 00:05:52,430
嗯

106
00:05:52,940 --> 00:05:55,640
既如此 你在那裡稍等便是

107
00:06:07,130 --> 00:06:09,540
那武士準備戰鬥嗎

108
00:06:09,540 --> 00:06:11,120
簡直是自尋死路

109
00:06:11,430 --> 00:06:14,320
我們得想辦法吸引洞穴巨人的注意力

110
00:06:14,320 --> 00:06:15,460
「迅疾雷光」

111
00:06:20,480 --> 00:06:22,500
甚至都不看我一眼？

112
00:06:22,500 --> 00:06:23,500
大家一起上

113
00:06:23,500 --> 00:06:24,770
好…好的

114
00:06:24,770 --> 00:06:26,880
等下 剛才那下你們也看見了吧

115
00:06:27,330 --> 00:06:31,230
憑我們的攻擊力 單純施放咒語也沒什麼效果

116
00:06:31,230 --> 00:06:32,880
你是要我們袖手旁觀嗎

117
00:06:32,880 --> 00:06:36,100
不是的 你們會風咒語嗎

118
00:06:36,540 --> 00:06:38,300
會倒是會的

119
00:06:38,300 --> 00:06:39,300
我有個主意

120
00:06:39,550 --> 00:06:43,930
先將強風凝聚起來 我一給信號就在那附近展開

121
00:06:45,020 --> 00:06:47,680
可是 光把風聚集起來不夠吧

122
00:06:47,680 --> 00:06:50,950
沒時間了 你們別問了 按我說的做吧

123
00:06:52,400 --> 00:06:54,910
好 就照你說的做

124
00:06:55,170 --> 00:06:56,610
沒辦法了

125
00:06:56,610 --> 00:06:58,280
明…明白了

126
00:06:58,750 --> 00:07:00,170
「疾風起」

127
00:07:04,710 --> 00:07:06,920
發生什麼事都不要停下咒語

128
00:07:07,830 --> 00:07:08,870
「笛手吹奏」

129
00:07:19,360 --> 00:07:20,890
「龍之咆哮」？

130
00:07:20,890 --> 00:07:23,800
那只是噪音 加工後聽起來像而已

131
00:07:23,800 --> 00:07:26,500
但即便是假的 龍終歸是龍

132
00:07:26,830 --> 00:07:28,900
只要它察覺到捕食者的氣息…

133
00:07:31,610 --> 00:07:33,240
很好 機會來了 快跑

134
00:07:45,950 --> 00:07:47,360
「無垢純白」？

135
00:08:04,650 --> 00:08:06,190
何等堅硬

136
00:08:06,490 --> 00:08:08,750
彷彿遭受了雷電洗禮一般

137
00:08:09,340 --> 00:08:11,150
請稍等片刻

138
00:08:11,150 --> 00:08:14,320
等麻痺退去 在下就背你

139
00:08:14,320 --> 00:08:15,920
唔 嗯

140
00:08:17,010 --> 00:08:20,350
各位義士 多謝相助

141
00:08:20,770 --> 00:08:23,830
多虧各位 在下才能抓住千載難逢的良機

142
00:08:24,350 --> 00:08:27,640
那聲怒吼實乃魄力十足

143
00:08:27,960 --> 00:08:32,360
在下險些在開學典禮前就嚇尿了

144
00:08:44,070 --> 00:08:47,120
我們跟他們分開了啊

145
00:08:47,120 --> 00:08:49,670
我倒是希望跟你也分開

146
00:08:51,990 --> 00:08:56,760
這麼說 你沒有任何策略 就去阻擋洞穴巨人了嗎

147
00:08:56,760 --> 00:08:57,610
策略？

148
00:08:59,010 --> 00:09:01,400
在下不曾考慮策略

149
00:09:01,400 --> 00:09:05,380
何況在下的刀暫無刀刃

150
00:09:05,380 --> 00:09:07,530
當時實在是難敵巨人啊

151
00:09:07,530 --> 00:09:09,460
哪有你這麼魯莽的

152
00:09:09,460 --> 00:09:12,750
我們的咒語要是失敗 你就死定了

153
00:09:12,750 --> 00:09:14,750
言之有理啊

154
00:09:14,750 --> 00:09:19,520
方才入學便死裡逃生 在下真是吉星高照

155
00:09:19,970 --> 00:09:22,920
真是琢磨不透她 不過…

156
00:09:23,240 --> 00:09:26,440
她那髮色 無垢純白

157
00:09:26,930 --> 00:09:30,810
是魔素傳導性高的水晶般的髮質造就的

158
00:09:30,810 --> 00:09:34,750
更重要的是 這說明她體內的魔力循環很強勁

159
00:09:35,210 --> 00:09:39,260
也就是說 她的魔法師潛力極高

160
00:09:39,260 --> 00:09:40,710
諸位新生

161
00:09:41,180 --> 00:09:42,260
肅靜

162
00:09:42,780 --> 00:09:45,000
有請校長上台

163
00:09:58,450 --> 00:10:00,680
我是校長艾絲美拉達

164
00:10:00,680 --> 00:10:04,110
容我先為開學典禮上的意外致歉

165
00:10:04,110 --> 00:10:07,840
迎新遊行中失控的洞穴巨人已被捕獲

166
00:10:07,840 --> 00:10:10,480
受傷的學生也已治療完畢

167
00:10:10,770 --> 00:10:13,310
光是看著她就冷汗直冒

168
00:10:13,770 --> 00:10:16,440
那位女士的本事相當了得啊

169
00:10:18,440 --> 00:10:20,970
這裡是金伯利魔法學校

170
00:10:20,970 --> 00:10:25,200
各位接下來將在這裡學習七年

171
00:10:25,200 --> 00:10:28,810
核心校風有兩條 自由主義和成果主義

172
00:10:28,810 --> 00:10:30,540
簡單來說就是

173
00:10:31,200 --> 00:10:34,660
任性而為 任性而亡

174
00:10:38,450 --> 00:10:41,050
我的話並非比喻

175
00:10:41,050 --> 00:10:44,720
在金伯利 能平安畢業的學生約為八成

176
00:10:45,030 --> 00:10:49,430
剩下兩成 有人因術式失控變成殘廢

177
00:10:49,980 --> 00:10:54,150
有人被召喚物拖走 音訊全無

178
00:10:54,460 --> 00:10:58,680
有人喪心病狂 企圖害人性命 最終死去

179
00:10:58,680 --> 00:11:00,270
大致就這幾種

180
00:11:00,270 --> 00:11:03,240
在魔法界 我們這樣稱呼他們的下場

181
00:11:03,700 --> 00:11:05,470
「為魔所噬」

182
00:11:06,250 --> 00:11:09,070
不過 這就是學習魔道的風險

183
00:11:09,070 --> 00:11:12,010
我們就是這樣不斷進步的

184
00:11:12,320 --> 00:11:15,090
建立在無數屍體的基礎上

185
00:11:15,460 --> 00:11:17,140
我再重複一遍

186
00:11:17,140 --> 00:11:19,470
任性而為 任性而亡

187
00:11:19,470 --> 00:11:21,720
但一定要留下成果

188
00:11:21,720 --> 00:11:23,980
虎死留皮

189
00:11:23,980 --> 00:11:25,940
你們必須成為老虎

190
00:11:25,940 --> 00:11:29,210
否則在這裡連骨頭都不會剩下

191
00:11:29,560 --> 00:11:30,640
我說完了

192
00:11:30,640 --> 00:11:35,140
如果對我說的話有疑問 我可以當場解答

193
00:11:35,450 --> 00:11:36,600
校長閣下

194
00:11:37,010 --> 00:11:38,360
在下能否說一句呢

195
00:11:38,800 --> 00:11:40,960
可以 說吧

196
00:11:40,960 --> 00:11:42,600
頭疼時

197
00:11:42,600 --> 00:11:46,870
這般 揉此處的穴位十分有效

198
00:11:46,870 --> 00:11:47,740
啊？

199
00:11:49,540 --> 00:11:51,450
這是提問嗎

200
00:11:51,450 --> 00:11:53,830
非也 此乃諫言

201
00:11:53,830 --> 00:11:56,100
在下見您似乎頗感不適

202
00:11:57,480 --> 00:12:01,270
沒有別的問題 就繼續進行開學典禮

203
00:12:01,270 --> 00:12:03,000
你傻嗎

204
00:12:03,000 --> 00:12:05,520
不 這招確實有效

205
00:12:05,520 --> 00:12:07,290
你傻吧

206
00:12:07,660 --> 00:12:09,180
你莫非不信在下

207
00:12:09,180 --> 00:12:11,860
下面是 迎新宴會

208
00:12:12,220 --> 00:12:14,260
現在起允許私語

209
00:12:14,260 --> 00:12:15,480
你們就儘管吃喝

210
00:12:15,480 --> 00:12:18,000
跟未來的同學盡情交談吧

211
00:12:18,000 --> 00:12:20,620
各位請入座

212
00:12:22,060 --> 00:12:23,480
入座？

213
00:12:28,970 --> 00:12:29,460
什麼

214
00:12:29,460 --> 00:12:30,530
怎麼了

215
00:12:33,230 --> 00:12:34,920
這可真離奇

216
00:12:45,840 --> 00:12:49,180
各位一年級新生 歡迎來到金伯利

217
00:12:49,660 --> 00:12:51,300
我們的校長很可怕吧

218
00:12:51,300 --> 00:12:53,500
不過你們可以先忘了她說的話

219
00:12:53,500 --> 00:12:54,710
因為誇張了不少

220
00:12:54,710 --> 00:12:58,450
我們學長學姐也會努力保障大家的安全

221
00:12:58,770 --> 00:13:00,200
來 喝吧喝吧

222
00:13:00,200 --> 00:13:03,130
這裡的白葡萄汁好喝到犯罪

223
00:13:07,330 --> 00:13:08,180
在這呢

224
00:13:08,180 --> 00:13:08,550
喂 別拽我

225
00:13:08,550 --> 00:13:09,590
喂
喂 別拽我

226
00:13:09,590 --> 00:13:09,820
喂 別拽我

227
00:13:09,820 --> 00:13:11,540
喲 是你們啊

228
00:13:11,540 --> 00:13:13,540
總算碰頭了

229
00:13:14,010 --> 00:13:17,550
只差被送去醫務室的那個女生了

230
00:13:17,550 --> 00:13:18,840
我來晚…

231
00:13:24,160 --> 00:13:25,800
順利抵達了啊

232
00:13:27,330 --> 00:13:29,030
看來人到齊了

233
00:13:29,400 --> 00:13:33,350
是啊 終於可以互相認識了

234
00:13:36,790 --> 00:13:38,660
那就從我開始

235
00:13:39,080 --> 00:13:41,530
我叫米雪拉·麥克法蘭

236
00:13:43,210 --> 00:13:48,140
我是英魔法國南部歷史悠久的名門望族

237
00:13:48,470 --> 00:13:50,580
麥克法蘭家的長女

238
00:13:50,940 --> 00:13:52,370
請叫我雪拉吧

239
00:13:53,190 --> 00:13:56,300
不得了 果然是麥克法蘭家的千金

240
00:13:56,680 --> 00:13:58,610
有件事我早就想問了

241
00:13:58,610 --> 00:14:02,800
你們家族是中了所有人都會變成縱卷髮的詛咒嗎

242
00:14:02,800 --> 00:14:04,330
真沒禮貌

243
00:14:04,640 --> 00:14:07,670
這髮型是我們家族的象徵

244
00:14:07,670 --> 00:14:09,990
第一次見到時理應嘆服於其華麗

245
00:14:09,990 --> 00:14:12,280
激動到昏過去才合乎禮儀

246
00:14:13,360 --> 00:14:15,260
好了 下面輪到你了

247
00:14:15,940 --> 00:14:19,490
那個 我叫卡蒂·阿爾托

248
00:14:19,490 --> 00:14:22,930
是來自聯邦北方湖水國的留學生

249
00:14:23,210 --> 00:14:25,670
那個 魔法生物…

250
00:14:25,670 --> 00:14:28,050
準確來說 是動物我都喜歡

251
00:14:28,430 --> 00:14:32,410
還有 非常感謝大家救了我

252
00:14:32,410 --> 00:14:34,410
不客氣 你沒事就好

253
00:14:34,920 --> 00:14:38,220
當時你突然就跑了出去 到底是怎麼回事

254
00:14:38,220 --> 00:14:42,080
嗯 可能是別人的惡作劇吧

255
00:14:42,080 --> 00:14:44,420
這事等下再聊吧

256
00:14:44,700 --> 00:14:46,680
現在該享受宴會

257
00:14:46,680 --> 00:14:48,080
你叫什麼名字

258
00:14:48,440 --> 00:14:50,710
我叫凱·格林伍德

259
00:14:50,710 --> 00:14:53,790
來自歷史還算悠久的魔法農戶

260
00:14:54,120 --> 00:14:56,990
我對植物方面的知識很自信

261
00:14:57,370 --> 00:15:00,120
另外 你們要是想吃美味蔬菜就跟我說

262
00:15:00,120 --> 00:15:02,910
務必讓在下嚐嚐

263
00:15:02,910 --> 00:15:04,880
好 回頭寄給你

264
00:15:05,250 --> 00:15:06,910
下一個 到你了

265
00:15:07,370 --> 00:15:08,990
我叫皮特·雷斯頓

266
00:15:09,480 --> 00:15:11,970
父母都是非魔法族

267
00:15:12,350 --> 00:15:13,850
我家沒有歷史

268
00:15:14,180 --> 00:15:15,120
說完了

269
00:15:15,120 --> 00:15:17,730
你是拿到普通人名額入學的啊

270
00:15:17,730 --> 00:15:20,000
能闖過那麼窄的獨木橋 真不簡單

271
00:15:20,000 --> 00:15:22,220
客套話就免了吧

272
00:15:22,500 --> 00:15:24,420
我沒想跟你們走得太近

273
00:15:25,890 --> 00:15:27,460
怎…怎麼

274
00:15:27,760 --> 00:15:30,530
沒什麼 我是覺得你讀的那本書很不錯

275
00:15:30,530 --> 00:15:32,660
那是阿爾弗雷德·貝爾納寫的

276
00:15:32,660 --> 00:15:36,000
面向非魔法世家出身者的魔導入門書吧

277
00:15:36,000 --> 00:15:37,210
你知道嗎

278
00:15:37,210 --> 00:15:39,660
這可是我反覆讀過很多遍的名著

279
00:15:39,660 --> 00:15:42,770
章節之間的小故事很幽默 很有意思

280
00:15:42,770 --> 00:15:45,910
就是說啊 很經典對吧

281
00:15:45,910 --> 00:15:50,280
尤其是第三章結束後那段 跟魔法法官的對話…

282
00:15:53,430 --> 00:15:55,740
還…還沒自我介紹完吧

283
00:15:56,130 --> 00:15:57,150
好了 下一個

284
00:15:57,150 --> 00:16:00,050
嗯 我叫奧利佛·霍恩

285
00:16:00,400 --> 00:16:02,800
我家是在兩代前成為魔法家庭的

286
00:16:02,800 --> 00:16:05,530
不過出於某些原因 我目前住在親戚家

287
00:16:06,050 --> 00:16:10,340
親戚家的表哥表姐在金伯利的高學年就讀

288
00:16:10,340 --> 00:16:12,680
我聽他們說了不少這裡的事

289
00:16:12,680 --> 00:16:15,520
你當時用的「龍之咆哮」太驚人了

290
00:16:15,790 --> 00:16:19,500
我還是第一次見人那樣運用笛子咒語

291
00:16:19,860 --> 00:16:22,920
我比較擅長改編和運用魔法

292
00:16:22,920 --> 00:16:24,580
能派上用場就好

293
00:16:24,880 --> 00:16:26,970
好了 最後到你了吧

294
00:16:27,260 --> 00:16:28,150
嗯

295
00:16:29,360 --> 00:16:33,560
在下來自日之國東陸永泉的武士門第

296
00:16:33,870 --> 00:16:36,090
名喚響谷奈奈緒

297
00:16:36,390 --> 00:16:38,470
日之國對吧

298
00:16:38,780 --> 00:16:41,580
在下因機緣巧合來此

299
00:16:41,580 --> 00:16:45,370
大約半年前 在下即將陣亡時

300
00:16:45,370 --> 00:16:48,290
一位路過的魔法師出手相救

301
00:16:48,600 --> 00:16:51,420
在下承蒙那位麥克法蘭閣下的邀請

302
00:16:51,940 --> 00:16:54,100
來到了這裡

303
00:16:55,370 --> 00:16:57,930
你剛才說 那人叫麥克法蘭？

304
00:16:57,930 --> 00:17:01,350
說起來 那人跟雪拉閣下同姓

305
00:17:02,060 --> 00:17:04,020
髮型也很像

306
00:17:04,020 --> 00:17:07,260
那人應該是我父親

307
00:17:07,260 --> 00:17:10,020
他是金伯利的外聘講師

308
00:17:10,020 --> 00:17:13,730
沒想到他竟然去遙遠的東方發掘人才了

309
00:17:13,730 --> 00:17:17,090
你父母不是魔法族吧

310
00:17:17,360 --> 00:17:19,450
那就表示 你跟我一樣 也是通過考試…

311
00:17:19,450 --> 00:17:22,600
不 我並未參加知識測試

312
00:17:22,600 --> 00:17:27,020
應該是我父親用了金伯利教師的特別推薦名額吧

313
00:17:27,020 --> 00:17:29,270
特別推薦名額

314
00:17:32,380 --> 00:17:34,140
總而言之

315
00:17:34,140 --> 00:17:37,450
大家都知道彼此的名字了 咱們開吃吧

316
00:17:37,450 --> 00:17:38,620
是啊

317
00:17:38,620 --> 00:17:40,890
我…我都餓扁了

318
00:17:40,890 --> 00:17:42,590
來 喝吧喝吧

319
00:17:44,820 --> 00:17:47,040
在下也餓了

320
00:17:47,040 --> 00:17:49,140
這是在下那份嗎

321
00:17:50,370 --> 00:17:51,840
你等下 奈奈緒

322
00:17:51,840 --> 00:17:54,080
那是六人份的烤牛肉

323
00:17:54,930 --> 00:17:58,710
您真愛說笑 在下一個人也吃得完

324
00:17:58,710 --> 00:18:02,600
毫無疑問 你不懂這裡的用餐方式

325
00:18:02,600 --> 00:18:05,910
你在位置上坐好 我給你拿吃的

326
00:18:05,910 --> 00:18:10,320
那麼 我來讓你完美掌握餐桌禮儀吧

327
00:18:13,550 --> 00:18:17,130
菜不停端上來 在下就像公主似的

328
00:18:17,550 --> 00:18:19,270
你好像很開心啊

329
00:18:19,270 --> 00:18:21,530
奧利佛 也幫我拿點吧

330
00:18:21,530 --> 00:18:25,040
喂 奧利佛 公主又多了一位哦

331
00:18:26,970 --> 00:18:28,930
順便也幫我拿一下吧

332
00:18:29,820 --> 00:18:31,650
怎麼會變成這樣

333
00:18:32,020 --> 00:18:33,430
受不了

334
00:18:34,220 --> 00:18:36,780
吃飯時就不能安靜點嗎

335
00:18:37,810 --> 00:18:40,080
你的盤子裡全是肉啊

336
00:18:40,080 --> 00:18:42,890
偏食可不好 這盤拿去吃吧

337
00:18:43,240 --> 00:18:45,360
喂 我吃不了蔬菜…

338
00:18:45,630 --> 00:18:48,560
有個人不知道蔬菜有多可貴啊

339
00:18:48,560 --> 00:18:50,350
要跟我熱議一下嗎

340
00:18:50,350 --> 00:18:52,000
熱得我難受

341
00:18:54,460 --> 00:18:56,960
美味 再來一份

342
00:19:14,730 --> 00:19:18,500
想起來了 這裡有擾時精出沒

343
00:19:22,960 --> 00:19:25,230
實際上才剛過五點啊

344
00:19:31,320 --> 00:19:32,930
早上好 皮特

345
00:19:33,600 --> 00:19:35,420
氣消了嗎

346
00:19:36,490 --> 00:19:38,260
跟你住同一間？

347
00:19:39,030 --> 00:19:42,410
你可別大吵大鬧 打擾我看書

348
00:19:42,740 --> 00:19:46,270
今天是上課的第一天 別感冒了

349
00:19:50,920 --> 00:19:52,980
這裡魔素好濃啊

350
00:19:55,580 --> 00:19:58,910
起得真早 有什麼在意的事嗎

351
00:19:59,500 --> 00:20:03,160
我只是想趁著安靜看看校園

352
00:20:03,510 --> 00:20:04,690
你是誰

353
00:20:04,970 --> 00:20:08,920
請放心 我是格溫大人派來的密探

354
00:20:09,290 --> 00:20:12,700
格溫大人吩咐我 在您熟悉這裡前保護您

355
00:20:13,060 --> 00:20:14,840
是表哥幹的啊

356
00:20:14,840 --> 00:20:16,750
特地派個密探也太誇張了

357
00:20:16,960 --> 00:20:19,320
格溫大人是擔心您的安危

358
00:20:19,320 --> 00:20:20,580
我知道

359
00:20:20,920 --> 00:20:22,460
他向來這樣

360
00:20:22,900 --> 00:20:26,640
你會跟著我一段時間吧 我該怎麼稱呼你

361
00:20:26,640 --> 00:20:27,760
隨您稱呼

362
00:20:27,760 --> 00:20:29,510
這才是最讓人頭疼的

363
00:20:29,510 --> 00:20:31,520
乖乖告訴我名字吧

364
00:20:31,520 --> 00:20:34,150
那麼 請叫我特蕾莎·卡斯特吧

365
00:20:34,150 --> 00:20:36,320
明白了 卡斯特小姐

366
00:20:36,720 --> 00:20:39,320
過段時間你會露面的吧

367
00:20:39,320 --> 00:20:42,490
請容我改日再正式拜見您

368
00:20:42,800 --> 00:20:46,870
那麼 有需要請隨時叫我

369
00:20:56,530 --> 00:20:58,560
好涼的清水

370
00:21:06,260 --> 00:21:08,170
這不是奧利佛嗎

371
00:21:09,400 --> 00:21:11,850
你也起得這麼早啊

372
00:21:14,330 --> 00:21:15,240
「穿上遮好」

373
00:21:22,520 --> 00:21:23,310
這是…

374
00:21:23,310 --> 00:21:25,320
你在幹什麼呢

375
00:21:25,320 --> 00:21:26,880
怎麼能在這裡沐浴

376
00:21:26,880 --> 00:21:29,930
雖說是清晨 但男生宿舍也看得很清楚啊

377
00:21:30,810 --> 00:21:33,220
在下又沒幹見不得人的事

378
00:21:33,220 --> 00:21:35,780
你是不在乎 但看到你的人會很為難

379
00:21:36,120 --> 00:21:39,380
而且這不是沐浴 是潔身

380
00:21:39,380 --> 00:21:41,570
在下認為上一場戰鬥染上的血汙

381
00:21:41,570 --> 00:21:44,140
要洗淨才合乎禮儀

382
00:21:45,880 --> 00:21:47,800
你這身傷是？

383
00:21:48,630 --> 00:21:51,500
哦 是在上一場戰鬥受的傷

384
00:21:51,830 --> 00:21:53,880
要是讓你感到不適 實在抱歉

385
00:21:54,950 --> 00:21:55,790
不是的

386
00:22:06,810 --> 00:22:08,820
你可以看著我 諾爾

387
00:22:08,820 --> 00:22:10,440
現在正是時候

388
00:22:14,150 --> 00:22:15,010
那個…

389
00:22:15,270 --> 00:22:16,800
(那時的我 是碌碌無聞的“我”)

390
00:22:16,800 --> 00:22:20,540
那什麼潔身 你還是趕緊完事吧
(那時的我 是碌碌無聞的“我”)

391
00:22:20,540 --> 00:22:20,790
(那時的我 是碌碌無聞的“我”)

392
00:22:20,790 --> 00:22:22,390
馬上就結束了
(那時的我 是碌碌無聞的“我”)

393
00:22:22,390 --> 00:22:23,270
(那時的我 是碌碌無聞的“我”)

394
00:22:23,270 --> 00:22:24,860
糟糕 忘記帶擦身子的東西了
(那時的我 是碌碌無聞的“我”)

395
00:22:24,860 --> 00:22:25,930
糟糕 忘記帶擦身子的東西了
(被無償的愛和溫暖保護著)

396
00:22:25,930 --> 00:22:26,920
用這個擦吧
(被無償的愛和溫暖保護著)

397
00:22:26,920 --> 00:22:27,700
(被無償的愛和溫暖保護著)

398
00:22:27,700 --> 00:22:28,610
這不合適吧
(被無償的愛和溫暖保護著)

399
00:22:28,610 --> 00:22:29,800
別說了
(被無償的愛和溫暖保護著)

400
00:22:29,800 --> 00:22:31,520
(被無償的愛和溫暖保護著)

401
00:22:31,520 --> 00:22:33,900
那在下就不客氣了
(被無償的愛和溫暖保護著)

402
00:22:33,900 --> 00:22:34,010
那在下就不客氣了

403
00:22:35,200 --> 00:22:35,470
這下就欠你一個大人情了 奧利佛

404
00:22:35,470 --> 00:22:38,550
這下就欠你一個大人情了 奧利佛
(轉瞬即逝的時間殘酷無情)

405
00:22:38,550 --> 00:22:40,170
(轉瞬即逝的時間殘酷無情)

406
00:22:40,170 --> 00:22:41,360
奈奈緒·響谷
(轉瞬即逝的時間殘酷無情)

407
00:22:41,360 --> 00:22:41,630
奈奈緒·響谷
(帶走了我心愛的你)

408
00:22:41,630 --> 00:22:42,410
(帶走了我心愛的你)

409
00:22:42,410 --> 00:22:44,660
我在金伯利魔法學校
(帶走了我心愛的你)

410
00:22:44,660 --> 00:22:44,970
(帶走了我心愛的你)

411
00:22:44,970 --> 00:22:45,960
遇見了這位天真無邪的古怪少女
(帶走了我心愛的你)

412
00:22:45,960 --> 00:22:47,010
遇見了這位天真無邪的古怪少女
(我那小小的手 實在是捧不下)

413
00:22:47,010 --> 00:22:48,000
(我那小小的手 實在是捧不下)

414
00:22:48,000 --> 00:22:49,650
但是她身上
(我那小小的手 實在是捧不下)

415
00:22:49,650 --> 00:22:50,110
(我那小小的手 實在是捧不下)

416
00:22:50,110 --> 00:22:51,470
有一股微弱的 抹不掉的…
(我那小小的手 實在是捧不下)

417
00:22:51,470 --> 00:22:53,060
有一股微弱的 抹不掉的…
(留下悔恨)

418
00:22:53,060 --> 00:22:53,610
(留下悔恨)

419
00:22:53,610 --> 00:22:55,310
血腥味
(留下悔恨)

420
00:22:55,310 --> 00:22:56,710
(留下悔恨)

421
00:22:56,950 --> 00:22:57,010
(第一集 開學典禮)

422
00:22:57,010 --> 00:22:59,320
(第一集 開學典禮)
(咚…咚…孤獨)

423
00:22:59,320 --> 00:23:02,000
(第一集 開學典禮)
(心臟只是反覆跳動)

424
00:23:02,000 --> 00:23:03,870
(心臟只是反覆跳動)

425
00:23:03,870 --> 00:23:06,760
(不知不覺間)

426
00:23:06,760 --> 00:23:12,000
(憤怒如怪物般吞噬心靈)

427
00:23:12,000 --> 00:23:17,200
(將我變成了陌生的人)

428
00:23:17,200 --> 00:23:25,540
(那天被愛著的“我” 已不復存在)

429
00:23:36,410 --> 00:23:39,950
(下集 魔法劍)
`
		python_ass = `[Script Info]
; This is an Advanced Sub Station Alpha v4+ script.
Title:
ScriptType: v4.00+
Collisions: Normal
PlayDepth: 0

[V4+ Styles]


[Events]
Format: Layer, Start, End, Style, Name, MarginL, MarginR, MarginV, Effect, Text

Dialogue: 0,0:00:00.49,0:00:02.29,Default,,0,0,0,,金伯利魔法學校\n(金伯利魔法學校)
Dialogue: 0,0:00:02.29,0:00:02.41,Default,,0,0,0,,(金伯利魔法學校)
Dialogue: 0,0:00:03.04,0:00:03.48,Default,,0,0,0,,(20%的學生)
Dialogue: 0,0:00:03.48,0:00:05.31,Default,,0,0,0,,在畢業之前\n(20%的學生)
Dialogue: 0,0:00:05.54,0:00:05.80,Default,,0,0,0,,(無法活著)
Dialogue: 0,0:00:05.80,0:00:07.48,Default,,0,0,0,,有兩成學生\n(無法活著)
Dialogue: 0,0:00:08.50,0:00:09.34,Default,,0,0,0,,(從這裡畢業)
Dialogue: 0,0:00:09.34,0:00:10.85,Default,,0,0,0,,會為魔所噬\n(從這裡畢業)
Dialogue: 0,0:00:10.85,0:00:11.96,Default,,0,0,0,,(從這裡畢業)
Dialogue: 0,0:00:20.21,0:00:22.71,Default,,0,0,0,,連「不開花的傑克」都綻放得如此美麗
Dialogue: 0,0:00:24.23,0:00:26.72,Default,,0,0,0,,哎呀呀 這位學生
Dialogue: 0,0:00:26.72,0:00:29.08,Default,,0,0,0,,你非常緊張啊
Dialogue: 0,0:00:29.50,0:00:30.72,Default,,0,0,0,,我看起來很緊張嗎
Dialogue: 0,0:00:30.72,0:00:33.89,Default,,0,0,0,,是的 你大可以放鬆點
Dialogue: 0,0:00:33.89,0:00:36.32,Default,,0,0,0,,畢竟今天是開學典禮
Dialogue: 0,0:00:36.61,0:00:40.39,Default,,0,0,0,,無論你將走向多麼恐怖的未來
Dialogue: 0,0:00:40.97,0:00:42.71,Default,,0,0,0,,謝謝關心 夫人
Dialogue: 0,0:00:45.53,0:00:47.32,Default,,0,0,0,,恐怖的未來啊
Dialogue: 0,0:00:47.83,0:00:51.31,Default,,0,0,0,,估計每個新生都會受到同樣的警告吧
Dialogue: 0,0:00:52.02,0:00:55.09,Default,,0,0,0,,然而最麻煩的是 這話並非信口開河
Dialogue: 0,0:00:55.72,0:00:58.41,Default,,0,0,0,,因為我即將就讀的學校…
Dialogue: 0,0:01:01.85,0:01:04.00,Default,,0,0,0,,嚇死我了
Dialogue: 0,0:01:04.28,0:01:07.73,Default,,0,0,0,,恐怖的未來 究竟是怎樣的啊
Dialogue: 0,0:01:08.90,0:01:11.66,Default,,0,0,0,,桀驁植物說的話別往心裡去
Dialogue: 0,0:01:12.73,0:01:17.63,Default,,0,0,0,,那類魔法植物的性格 跟土壤中的魔素性質有關
Dialogue: 0,0:01:18.05,0:01:20.82,Default,,0,0,0,,據說這裡性格惡劣的尤其多
Dialogue: 0,0:01:20.82,0:01:24.87,Default,,0,0,0,,這樣啊 我不太熟悉植物
Dialogue: 0,0:01:24.87,0:01:26.83,Default,,0,0,0,,但還挺喜歡魔法生物的
Dialogue: 0,0:01:26.83,0:01:29.24,Default,,0,0,0,,哦？你喜歡什麼呢
Dialogue: 0,0:01:29.24,0:01:30.91,Default,,0,0,0,,什麼都喜歡
Dialogue: 0,0:01:30.91,0:01:33.61,Default,,0,0,0,,小的喜歡 大的也喜歡
Dialogue: 0,0:01:33.61,0:01:35.09,Default,,0,0,0,,扭來扭去的也喜歡
Dialogue: 0,0:01:35.09,0:01:37.49,Default,,0,0,0,,扭來扭去？那是什麼啊
Dialogue: 0,0:01:37.49,0:01:40.22,Default,,0,0,0,,這位同學 喊你呢
Dialogue: 0,0:01:41.00,0:01:42.05,Default,,0,0,0,,喊我？
Dialogue: 0,0:01:42.05,0:01:45.22,Default,,0,0,0,,請多加注意
Dialogue: 0,0:01:45.93,0:01:49.47,Default,,0,0,0,,你差點踩到夫人的莖了
Dialogue: 0,0:01:49.47,0:01:52.17,Default,,0,0,0,,小心被罵得狗血淋頭
Dialogue: 0,0:01:52.17,0:01:53.91,Default,,0,0,0,,真沒禮貌
Dialogue: 0,0:01:57.71,0:02:00.62,Default,,0,0,0,,別管我 我又不在乎
Dialogue: 0,0:02:01.77,0:02:05.94,Default,,0,0,0,,哎呀呀 你這身穿著還真稀奇啊
Dialogue: 0,0:02:06.79,0:02:08.94,Default,,0,0,0,,我說 那人莫非…
Dialogue: 0,0:02:08.94,0:02:10.59,Default,,0,0,0,,是武士嗎
Dialogue: 0,0:02:10.59,0:02:12.60,Default,,0,0,0,,嗯 是武士吧
Dialogue: 0,0:02:12.60,0:02:14.67,Default,,0,0,0,,我還是頭一次見到
Dialogue: 0,0:02:15.42,0:02:19.13,Default,,0,0,0,,那位少女為何如此吸引我
Dialogue: 0,0:02:19.75,0:02:22.69,Default,,0,0,0,,是因為異國裝扮太過稀奇嗎
Dialogue: 0,0:02:23.02,0:02:24.00,Default,,0,0,0,,還是說…
Dialogue: 0,0:02:31.02,0:02:33.84,Default,,0,0,0,,也許是我內心產生了某種感覺
Dialogue: 0,0:02:34.82,0:02:37.33,Default,,0,0,0,,它就像是種預感
Dialogue: 0,0:02:38.44,0:02:40.19,Default,,0,0,0,,人們常稱之為命運
Dialogue: 0,0:02:49.85,0:02:52.38,Default,,0,0,0,,是魔法生物遊行
Dialogue: 0,0:03:00.00,0:03:01.75,Default,,0,0,0,,不愧是金伯利
Dialogue: 0,0:03:01.75,0:03:04.76,Default,,0,0,0,,看完植物 又給我們看動物
Dialogue: 0,0:03:04.76,0:03:06.70,Default,,0,0,0,,我還是第一次見那種龍
Dialogue: 0,0:03:06.70,0:03:08.00,Default,,0,0,0,,你認識嗎
Dialogue: 0,0:03:08.00,0:03:10.61,Default,,0,0,0,,嗯 那是法夫納吧
Dialogue: 0,0:03:10.61,0:03:12.76,Default,,0,0,0,,其他龍的鱗片可沒這麼氣派
Dialogue: 0,0:03:12.76,0:03:15.18,Default,,0,0,0,,哦？你挺熟的嘛
Dialogue: 0,0:03:15.18,0:03:18.62,Default,,0,0,0,,也不算啦 我只是看過圖鑑 略知一二
Dialogue: 0,0:03:20.79,0:03:24.03,Default,,0,0,0,,怎麼了 你不是喜歡魔法生物嗎
Dialogue: 0,0:03:26.28,0:03:28.65,Default,,0,0,0,,我是喜歡 但是…
Dialogue: 0,0:03:29.58,0:03:30.34,Default,,0,0,0,,你們看
Dialogue: 0,0:03:30.97,0:03:34.29,Default,,0,0,0,,洞穴巨人跟其他魔獸一樣 也被牽出來遊行了
Dialogue: 0,0:03:34.61,0:03:36.87,Default,,0,0,0,,怎麼能做這種事呢
Dialogue: 0,0:03:38.04,0:03:40.47,Default,,0,0,0,,你說什麼呢 那可是洞穴巨人
Dialogue: 0,0:03:40.47,0:03:43.89,Default,,0,0,0,,聽不懂人話 野生的還會襲擊人類
Dialogue: 0,0:03:44.16,0:03:46.52,Default,,0,0,0,,將其馴服 為人類所用是理所當然的吧
Dialogue: 0,0:03:46.52,0:03:49.16,Default,,0,0,0,,那是因為人類侵犯了他們的領地啊
Dialogue: 0,0:03:49.16,0:03:51.49,Default,,0,0,0,,他們其實是心地善良的生物
Dialogue: 0,0:03:51.49,0:03:55.20,Default,,0,0,0,,在我鄉下老家 田地每年都會被那玩意糟蹋
Dialogue: 0,0:03:55.20,0:03:56.94,Default,,0,0,0,,我們的領地被侵犯就是活該囉
Dialogue: 0,0:03:56.94,0:03:59.53,Default,,0,0,0,,那些田地歸根結底也是他們的棲息地
Dialogue: 0,0:03:59.53,0:04:01.73,Default,,0,0,0,,喂 能不能安靜點
Dialogue: 0,0:04:03.25,0:04:04.63,Default,,0,0,0,,打擾我看書了
Dialogue: 0,0:04:05.19,0:04:06.54,Default,,0,0,0,,對不起
Dialogue: 0,0:04:06.54,0:04:07.53,Default,,0,0,0,,抱歉
Dialogue: 0,0:04:07.91,0:04:09.13,Default,,0,0,0,,知錯就好
Dialogue: 0,0:04:11.48,0:04:15.81,Default,,0,0,0,,那是獅鷲嗎 翅膀跟插畫不一樣
Dialogue: 0,0:04:16.68,0:04:19.46,Default,,0,0,0,,你們的心情我理解 但還是晚點再爭吧
Dialogue: 0,0:04:19.46,0:04:21.33,Default,,0,0,0,,好歹先自我介紹一下
Dialogue: 0,0:04:23.12,0:04:25.29,Default,,0,0,0,,也…也對
Dialogue: 0,0:04:26.09,0:04:27.67,Default,,0,0,0,,我叫…
Dialogue: 0,0:04:27.95,0:04:28.96,Default,,0,0,0,,「蹬地疾馳」
Dialogue: 0,0:04:39.85,0:04:41.20,Default,,0,0,0,,喂 你幹什麼呢
Dialogue: 0,0:04:41.20,0:04:43.62,Default,,0,0,0,,停下來 不能再接近遊行了
Dialogue: 0,0:04:43.62,0:04:44.74,Default,,0,0,0,,我知道
Dialogue: 0,0:04:44.74,0:04:46.50,Default,,0,0,0,,但我的腿不聽使喚
Dialogue: 0,0:04:46.50,0:04:47.51,Default,,0,0,0,,是魔法嗎
Dialogue: 0,0:04:49.64,0:04:51.03,Default,,0,0,0,,出什麼事了
Dialogue: 0,0:04:51.89,0:04:53.99,Default,,0,0,0,,我也不清楚
Dialogue: 0,0:04:53.99,0:04:55.08,Default,,0,0,0,,糟糕了
Dialogue: 0,0:04:55.45,0:04:57.48,Default,,0,0,0,,那個洞穴巨人 在向她走去
Dialogue: 0,0:05:00.26,0:05:02.63,Default,,0,0,0,,到底搞什麼啊 受不了
Dialogue: 0,0:05:02.88,0:05:04.38,Default,,0,0,0,,喂 出什麼事了
Dialogue: 0,0:05:04.38,0:05:06.92,Default,,0,0,0,,餘興節目…也不像啊
Dialogue: 0,0:05:12.61,0:05:14.00,Default,,0,0,0,,怎…怎麼會
Dialogue: 0,0:05:14.85,0:05:15.84,Default,,0,0,0,,糟了
Dialogue: 0,0:05:21.64,0:05:22.55,Default,,0,0,0,,好疼
Dialogue: 0,0:05:28.09,0:05:30.63,Default,,0,0,0,,這樣根本來不及
Dialogue: 0,0:05:34.54,0:05:37.45,Default,,0,0,0,,喝
Dialogue: 0,0:05:45.13,0:05:46.67,Default,,0,0,0,,還能跑嗎
Dialogue: 0,0:05:47.80,0:05:48.82,Default,,0,0,0,,好疼
Dialogue: 0,0:05:49.42,0:05:51.53,Default,,0,0,0,,不行 腿受傷了
Dialogue: 0,0:05:51.84,0:05:52.43,Default,,0,0,0,,嗯
Dialogue: 0,0:05:52.94,0:05:55.64,Default,,0,0,0,,既如此 你在那裡稍等便是
Dialogue: 0,0:06:07.13,0:06:09.54,Default,,0,0,0,,那武士準備戰鬥嗎
Dialogue: 0,0:06:09.54,0:06:11.12,Default,,0,0,0,,簡直是自尋死路
Dialogue: 0,0:06:11.43,0:06:14.32,Default,,0,0,0,,我們得想辦法吸引洞穴巨人的注意力
Dialogue: 0,0:06:14.32,0:06:15.46,Default,,0,0,0,,「迅疾雷光」
Dialogue: 0,0:06:20.48,0:06:22.50,Default,,0,0,0,,甚至都不看我一眼？
Dialogue: 0,0:06:22.50,0:06:23.50,Default,,0,0,0,,大家一起上
Dialogue: 0,0:06:23.50,0:06:24.77,Default,,0,0,0,,好…好的
Dialogue: 0,0:06:24.77,0:06:26.88,Default,,0,0,0,,等下 剛才那下你們也看見了吧
Dialogue: 0,0:06:27.33,0:06:31.23,Default,,0,0,0,,憑我們的攻擊力 單純施放咒語也沒什麼效果
Dialogue: 0,0:06:31.23,0:06:32.88,Default,,0,0,0,,你是要我們袖手旁觀嗎
Dialogue: 0,0:06:32.88,0:06:36.10,Default,,0,0,0,,不是的 你們會風咒語嗎
Dialogue: 0,0:06:36.54,0:06:38.30,Default,,0,0,0,,會倒是會的
Dialogue: 0,0:06:38.30,0:06:39.30,Default,,0,0,0,,我有個主意
Dialogue: 0,0:06:39.55,0:06:43.93,Default,,0,0,0,,先將強風凝聚起來 我一給信號就在那附近展開
Dialogue: 0,0:06:45.02,0:06:47.68,Default,,0,0,0,,可是 光把風聚集起來不夠吧
Dialogue: 0,0:06:47.68,0:06:50.95,Default,,0,0,0,,沒時間了 你們別問了 按我說的做吧
Dialogue: 0,0:06:52.40,0:06:54.91,Default,,0,0,0,,好 就照你說的做
Dialogue: 0,0:06:55.17,0:06:56.61,Default,,0,0,0,,沒辦法了
Dialogue: 0,0:06:56.61,0:06:58.28,Default,,0,0,0,,明…明白了
Dialogue: 0,0:06:58.75,0:07:00.17,Default,,0,0,0,,「疾風起」
Dialogue: 0,0:07:04.71,0:07:06.92,Default,,0,0,0,,發生什麼事都不要停下咒語
Dialogue: 0,0:07:07.83,0:07:08.87,Default,,0,0,0,,「笛手吹奏」
Dialogue: 0,0:07:19.36,0:07:20.89,Default,,0,0,0,,「龍之咆哮」？
Dialogue: 0,0:07:20.89,0:07:23.80,Default,,0,0,0,,那只是噪音 加工後聽起來像而已
Dialogue: 0,0:07:23.80,0:07:26.50,Default,,0,0,0,,但即便是假的 龍終歸是龍
Dialogue: 0,0:07:26.83,0:07:28.90,Default,,0,0,0,,只要它察覺到捕食者的氣息…
Dialogue: 0,0:07:31.61,0:07:33.24,Default,,0,0,0,,很好 機會來了 快跑
Dialogue: 0,0:07:45.95,0:07:47.36,Default,,0,0,0,,「無垢純白」？
Dialogue: 0,0:08:04.65,0:08:06.19,Default,,0,0,0,,何等堅硬
Dialogue: 0,0:08:06.49,0:08:08.75,Default,,0,0,0,,彷彿遭受了雷電洗禮一般
Dialogue: 0,0:08:09.34,0:08:11.15,Default,,0,0,0,,請稍等片刻
Dialogue: 0,0:08:11.15,0:08:14.32,Default,,0,0,0,,等麻痺退去 在下就背你
Dialogue: 0,0:08:14.32,0:08:15.92,Default,,0,0,0,,唔 嗯
Dialogue: 0,0:08:17.01,0:08:20.35,Default,,0,0,0,,各位義士 多謝相助
Dialogue: 0,0:08:20.77,0:08:23.83,Default,,0,0,0,,多虧各位 在下才能抓住千載難逢的良機
Dialogue: 0,0:08:24.35,0:08:27.64,Default,,0,0,0,,那聲怒吼實乃魄力十足
Dialogue: 0,0:08:27.96,0:08:32.36,Default,,0,0,0,,在下險些在開學典禮前就嚇尿了
Dialogue: 0,0:08:44.07,0:08:47.12,Default,,0,0,0,,我們跟他們分開了啊
Dialogue: 0,0:08:47.12,0:08:49.67,Default,,0,0,0,,我倒是希望跟你也分開
Dialogue: 0,0:08:51.99,0:08:56.76,Default,,0,0,0,,這麼說 你沒有任何策略 就去阻擋洞穴巨人了嗎
Dialogue: 0,0:08:56.76,0:08:57.61,Default,,0,0,0,,策略？
Dialogue: 0,0:08:59.01,0:09:01.40,Default,,0,0,0,,在下不曾考慮策略
Dialogue: 0,0:09:01.40,0:09:05.38,Default,,0,0,0,,何況在下的刀暫無刀刃
Dialogue: 0,0:09:05.38,0:09:07.53,Default,,0,0,0,,當時實在是難敵巨人啊
Dialogue: 0,0:09:07.53,0:09:09.46,Default,,0,0,0,,哪有你這麼魯莽的
Dialogue: 0,0:09:09.46,0:09:12.75,Default,,0,0,0,,我們的咒語要是失敗 你就死定了
Dialogue: 0,0:09:12.75,0:09:14.75,Default,,0,0,0,,言之有理啊
Dialogue: 0,0:09:14.75,0:09:19.52,Default,,0,0,0,,方才入學便死裡逃生 在下真是吉星高照
Dialogue: 0,0:09:19.97,0:09:22.92,Default,,0,0,0,,真是琢磨不透她 不過…
Dialogue: 0,0:09:23.24,0:09:26.44,Default,,0,0,0,,她那髮色 無垢純白
Dialogue: 0,0:09:26.93,0:09:30.81,Default,,0,0,0,,是魔素傳導性高的水晶般的髮質造就的
Dialogue: 0,0:09:30.81,0:09:34.75,Default,,0,0,0,,更重要的是 這說明她體內的魔力循環很強勁
Dialogue: 0,0:09:35.21,0:09:39.26,Default,,0,0,0,,也就是說 她的魔法師潛力極高
Dialogue: 0,0:09:39.26,0:09:40.71,Default,,0,0,0,,諸位新生
Dialogue: 0,0:09:41.18,0:09:42.26,Default,,0,0,0,,肅靜
Dialogue: 0,0:09:42.78,0:09:45.00,Default,,0,0,0,,有請校長上台
Dialogue: 0,0:09:58.45,0:10:00.68,Default,,0,0,0,,我是校長艾絲美拉達
Dialogue: 0,0:10:00.68,0:10:04.11,Default,,0,0,0,,容我先為開學典禮上的意外致歉
Dialogue: 0,0:10:04.11,0:10:07.84,Default,,0,0,0,,迎新遊行中失控的洞穴巨人已被捕獲
Dialogue: 0,0:10:07.84,0:10:10.48,Default,,0,0,0,,受傷的學生也已治療完畢
Dialogue: 0,0:10:10.77,0:10:13.31,Default,,0,0,0,,光是看著她就冷汗直冒
Dialogue: 0,0:10:13.77,0:10:16.44,Default,,0,0,0,,那位女士的本事相當了得啊
Dialogue: 0,0:10:18.44,0:10:20.97,Default,,0,0,0,,這裡是金伯利魔法學校
Dialogue: 0,0:10:20.97,0:10:25.20,Default,,0,0,0,,各位接下來將在這裡學習七年
Dialogue: 0,0:10:25.20,0:10:28.81,Default,,0,0,0,,核心校風有兩條 自由主義和成果主義
Dialogue: 0,0:10:28.81,0:10:30.54,Default,,0,0,0,,簡單來說就是
Dialogue: 0,0:10:31.20,0:10:34.66,Default,,0,0,0,,任性而為 任性而亡
Dialogue: 0,0:10:38.45,0:10:41.05,Default,,0,0,0,,我的話並非比喻
Dialogue: 0,0:10:41.05,0:10:44.72,Default,,0,0,0,,在金伯利 能平安畢業的學生約為八成
Dialogue: 0,0:10:45.03,0:10:49.43,Default,,0,0,0,,剩下兩成 有人因術式失控變成殘廢
Dialogue: 0,0:10:49.98,0:10:54.15,Default,,0,0,0,,有人被召喚物拖走 音訊全無
Dialogue: 0,0:10:54.46,0:10:58.68,Default,,0,0,0,,有人喪心病狂 企圖害人性命 最終死去
Dialogue: 0,0:10:58.68,0:11:00.27,Default,,0,0,0,,大致就這幾種
Dialogue: 0,0:11:00.27,0:11:03.24,Default,,0,0,0,,在魔法界 我們這樣稱呼他們的下場
Dialogue: 0,0:11:03.70,0:11:05.47,Default,,0,0,0,,「為魔所噬」
Dialogue: 0,0:11:06.25,0:11:09.07,Default,,0,0,0,,不過 這就是學習魔道的風險
Dialogue: 0,0:11:09.07,0:11:12.01,Default,,0,0,0,,我們就是這樣不斷進步的
Dialogue: 0,0:11:12.32,0:11:15.09,Default,,0,0,0,,建立在無數屍體的基礎上
Dialogue: 0,0:11:15.46,0:11:17.14,Default,,0,0,0,,我再重複一遍
Dialogue: 0,0:11:17.14,0:11:19.47,Default,,0,0,0,,任性而為 任性而亡
Dialogue: 0,0:11:19.47,0:11:21.72,Default,,0,0,0,,但一定要留下成果
Dialogue: 0,0:11:21.72,0:11:23.98,Default,,0,0,0,,虎死留皮
Dialogue: 0,0:11:23.98,0:11:25.94,Default,,0,0,0,,你們必須成為老虎
Dialogue: 0,0:11:25.94,0:11:29.21,Default,,0,0,0,,否則在這裡連骨頭都不會剩下
Dialogue: 0,0:11:29.56,0:11:30.64,Default,,0,0,0,,我說完了
Dialogue: 0,0:11:30.64,0:11:35.14,Default,,0,0,0,,如果對我說的話有疑問 我可以當場解答
Dialogue: 0,0:11:35.45,0:11:36.60,Default,,0,0,0,,校長閣下
Dialogue: 0,0:11:37.01,0:11:38.36,Default,,0,0,0,,在下能否說一句呢
Dialogue: 0,0:11:38.80,0:11:40.96,Default,,0,0,0,,可以 說吧
Dialogue: 0,0:11:40.96,0:11:42.60,Default,,0,0,0,,頭疼時
Dialogue: 0,0:11:42.60,0:11:46.87,Default,,0,0,0,,這般 揉此處的穴位十分有效
Dialogue: 0,0:11:46.87,0:11:47.74,Default,,0,0,0,,啊？
Dialogue: 0,0:11:49.54,0:11:51.45,Default,,0,0,0,,這是提問嗎
Dialogue: 0,0:11:51.45,0:11:53.83,Default,,0,0,0,,非也 此乃諫言
Dialogue: 0,0:11:53.83,0:11:56.10,Default,,0,0,0,,在下見您似乎頗感不適
Dialogue: 0,0:11:57.48,0:12:01.27,Default,,0,0,0,,沒有別的問題 就繼續進行開學典禮
Dialogue: 0,0:12:01.27,0:12:03.00,Default,,0,0,0,,你傻嗎
Dialogue: 0,0:12:03.00,0:12:05.52,Default,,0,0,0,,不 這招確實有效
Dialogue: 0,0:12:05.52,0:12:07.29,Default,,0,0,0,,你傻吧
Dialogue: 0,0:12:07.66,0:12:09.18,Default,,0,0,0,,你莫非不信在下
Dialogue: 0,0:12:09.18,0:12:11.86,Default,,0,0,0,,下面是 迎新宴會
Dialogue: 0,0:12:12.22,0:12:14.26,Default,,0,0,0,,現在起允許私語
Dialogue: 0,0:12:14.26,0:12:15.48,Default,,0,0,0,,你們就儘管吃喝
Dialogue: 0,0:12:15.48,0:12:18.00,Default,,0,0,0,,跟未來的同學盡情交談吧
Dialogue: 0,0:12:18.00,0:12:20.62,Default,,0,0,0,,各位請入座
Dialogue: 0,0:12:22.06,0:12:23.48,Default,,0,0,0,,入座？
Dialogue: 0,0:12:28.97,0:12:29.46,Default,,0,0,0,,什麼
Dialogue: 0,0:12:29.46,0:12:30.53,Default,,0,0,0,,怎麼了
Dialogue: 0,0:12:33.23,0:12:34.92,Default,,0,0,0,,這可真離奇
Dialogue: 0,0:12:45.84,0:12:49.18,Default,,0,0,0,,各位一年級新生 歡迎來到金伯利
Dialogue: 0,0:12:49.66,0:12:51.30,Default,,0,0,0,,我們的校長很可怕吧
Dialogue: 0,0:12:51.30,0:12:53.50,Default,,0,0,0,,不過你們可以先忘了她說的話
Dialogue: 0,0:12:53.50,0:12:54.71,Default,,0,0,0,,因為誇張了不少
Dialogue: 0,0:12:54.71,0:12:58.45,Default,,0,0,0,,我們學長學姐也會努力保障大家的安全
Dialogue: 0,0:12:58.77,0:13:00.20,Default,,0,0,0,,來 喝吧喝吧
Dialogue: 0,0:13:00.20,0:13:03.13,Default,,0,0,0,,這裡的白葡萄汁好喝到犯罪
Dialogue: 0,0:13:07.33,0:13:08.18,Default,,0,0,0,,在這呢
Dialogue: 0,0:13:08.18,0:13:08.55,Default,,0,0,0,,喂 別拽我
Dialogue: 0,0:13:08.55,0:13:09.59,Default,,0,0,0,,喂\n喂 別拽我
Dialogue: 0,0:13:09.59,0:13:09.82,Default,,0,0,0,,喂 別拽我
Dialogue: 0,0:13:09.82,0:13:11.54,Default,,0,0,0,,喲 是你們啊
Dialogue: 0,0:13:11.54,0:13:13.54,Default,,0,0,0,,總算碰頭了
Dialogue: 0,0:13:14.01,0:13:17.55,Default,,0,0,0,,只差被送去醫務室的那個女生了
Dialogue: 0,0:13:17.55,0:13:18.84,Default,,0,0,0,,我來晚…
Dialogue: 0,0:13:24.16,0:13:25.80,Default,,0,0,0,,順利抵達了啊
Dialogue: 0,0:13:27.33,0:13:29.03,Default,,0,0,0,,看來人到齊了
Dialogue: 0,0:13:29.40,0:13:33.35,Default,,0,0,0,,是啊 終於可以互相認識了
Dialogue: 0,0:13:36.79,0:13:38.66,Default,,0,0,0,,那就從我開始
Dialogue: 0,0:13:39.08,0:13:41.53,Default,,0,0,0,,我叫米雪拉·麥克法蘭
Dialogue: 0,0:13:43.21,0:13:48.14,Default,,0,0,0,,我是英魔法國南部歷史悠久的名門望族
Dialogue: 0,0:13:48.47,0:13:50.58,Default,,0,0,0,,麥克法蘭家的長女
Dialogue: 0,0:13:50.94,0:13:52.37,Default,,0,0,0,,請叫我雪拉吧
Dialogue: 0,0:13:53.19,0:13:56.30,Default,,0,0,0,,不得了 果然是麥克法蘭家的千金
Dialogue: 0,0:13:56.68,0:13:58.61,Default,,0,0,0,,有件事我早就想問了
Dialogue: 0,0:13:58.61,0:14:02.80,Default,,0,0,0,,你們家族是中了所有人都會變成縱卷髮的詛咒嗎
Dialogue: 0,0:14:02.80,0:14:04.33,Default,,0,0,0,,真沒禮貌
Dialogue: 0,0:14:04.64,0:14:07.67,Default,,0,0,0,,這髮型是我們家族的象徵
Dialogue: 0,0:14:07.67,0:14:09.99,Default,,0,0,0,,第一次見到時理應嘆服於其華麗
Dialogue: 0,0:14:09.99,0:14:12.28,Default,,0,0,0,,激動到昏過去才合乎禮儀
Dialogue: 0,0:14:13.36,0:14:15.26,Default,,0,0,0,,好了 下面輪到你了
Dialogue: 0,0:14:15.94,0:14:19.49,Default,,0,0,0,,那個 我叫卡蒂·阿爾托
Dialogue: 0,0:14:19.49,0:14:22.93,Default,,0,0,0,,是來自聯邦北方湖水國的留學生
Dialogue: 0,0:14:23.21,0:14:25.67,Default,,0,0,0,,那個 魔法生物…
Dialogue: 0,0:14:25.67,0:14:28.05,Default,,0,0,0,,準確來說 是動物我都喜歡
Dialogue: 0,0:14:28.43,0:14:32.41,Default,,0,0,0,,還有 非常感謝大家救了我
Dialogue: 0,0:14:32.41,0:14:34.41,Default,,0,0,0,,不客氣 你沒事就好
Dialogue: 0,0:14:34.92,0:14:38.22,Default,,0,0,0,,當時你突然就跑了出去 到底是怎麼回事
Dialogue: 0,0:14:38.22,0:14:42.08,Default,,0,0,0,,嗯 可能是別人的惡作劇吧
Dialogue: 0,0:14:42.08,0:14:44.42,Default,,0,0,0,,這事等下再聊吧
Dialogue: 0,0:14:44.70,0:14:46.68,Default,,0,0,0,,現在該享受宴會
Dialogue: 0,0:14:46.68,0:14:48.08,Default,,0,0,0,,你叫什麼名字
Dialogue: 0,0:14:48.44,0:14:50.71,Default,,0,0,0,,我叫凱·格林伍德
Dialogue: 0,0:14:50.71,0:14:53.79,Default,,0,0,0,,來自歷史還算悠久的魔法農戶
Dialogue: 0,0:14:54.12,0:14:56.99,Default,,0,0,0,,我對植物方面的知識很自信
Dialogue: 0,0:14:57.37,0:15:00.12,Default,,0,0,0,,另外 你們要是想吃美味蔬菜就跟我說
Dialogue: 0,0:15:00.12,0:15:02.91,Default,,0,0,0,,務必讓在下嚐嚐
Dialogue: 0,0:15:02.91,0:15:04.88,Default,,0,0,0,,好 回頭寄給你
Dialogue: 0,0:15:05.25,0:15:06.91,Default,,0,0,0,,下一個 到你了
Dialogue: 0,0:15:07.37,0:15:08.99,Default,,0,0,0,,我叫皮特·雷斯頓
Dialogue: 0,0:15:09.48,0:15:11.97,Default,,0,0,0,,父母都是非魔法族
Dialogue: 0,0:15:12.35,0:15:13.85,Default,,0,0,0,,我家沒有歷史
Dialogue: 0,0:15:14.18,0:15:15.12,Default,,0,0,0,,說完了
Dialogue: 0,0:15:15.12,0:15:17.73,Default,,0,0,0,,你是拿到普通人名額入學的啊
Dialogue: 0,0:15:17.73,0:15:20.00,Default,,0,0,0,,能闖過那麼窄的獨木橋 真不簡單
Dialogue: 0,0:15:20.00,0:15:22.22,Default,,0,0,0,,客套話就免了吧
Dialogue: 0,0:15:22.50,0:15:24.42,Default,,0,0,0,,我沒想跟你們走得太近
Dialogue: 0,0:15:25.89,0:15:27.46,Default,,0,0,0,,怎…怎麼
Dialogue: 0,0:15:27.76,0:15:30.53,Default,,0,0,0,,沒什麼 我是覺得你讀的那本書很不錯
Dialogue: 0,0:15:30.53,0:15:32.66,Default,,0,0,0,,那是阿爾弗雷德·貝爾納寫的
Dialogue: 0,0:15:32.66,0:15:36.00,Default,,0,0,0,,面向非魔法世家出身者的魔導入門書吧
Dialogue: 0,0:15:36.00,0:15:37.21,Default,,0,0,0,,你知道嗎
Dialogue: 0,0:15:37.21,0:15:39.66,Default,,0,0,0,,這可是我反覆讀過很多遍的名著
Dialogue: 0,0:15:39.66,0:15:42.77,Default,,0,0,0,,章節之間的小故事很幽默 很有意思
Dialogue: 0,0:15:42.77,0:15:45.91,Default,,0,0,0,,就是說啊 很經典對吧
Dialogue: 0,0:15:45.91,0:15:50.28,Default,,0,0,0,,尤其是第三章結束後那段 跟魔法法官的對話…
Dialogue: 0,0:15:53.43,0:15:55.74,Default,,0,0,0,,還…還沒自我介紹完吧
Dialogue: 0,0:15:56.13,0:15:57.15,Default,,0,0,0,,好了 下一個
Dialogue: 0,0:15:57.15,0:16:00.05,Default,,0,0,0,,嗯 我叫奧利佛·霍恩
Dialogue: 0,0:16:00.40,0:16:02.80,Default,,0,0,0,,我家是在兩代前成為魔法家庭的
Dialogue: 0,0:16:02.80,0:16:05.53,Default,,0,0,0,,不過出於某些原因 我目前住在親戚家
Dialogue: 0,0:16:06.05,0:16:10.34,Default,,0,0,0,,親戚家的表哥表姐在金伯利的高學年就讀
Dialogue: 0,0:16:10.34,0:16:12.68,Default,,0,0,0,,我聽他們說了不少這裡的事
Dialogue: 0,0:16:12.68,0:16:15.52,Default,,0,0,0,,你當時用的「龍之咆哮」太驚人了
Dialogue: 0,0:16:15.79,0:16:19.50,Default,,0,0,0,,我還是第一次見人那樣運用笛子咒語
Dialogue: 0,0:16:19.86,0:16:22.92,Default,,0,0,0,,我比較擅長改編和運用魔法
Dialogue: 0,0:16:22.92,0:16:24.58,Default,,0,0,0,,能派上用場就好
Dialogue: 0,0:16:24.88,0:16:26.97,Default,,0,0,0,,好了 最後到你了吧
Dialogue: 0,0:16:27.26,0:16:28.15,Default,,0,0,0,,嗯
Dialogue: 0,0:16:29.36,0:16:33.56,Default,,0,0,0,,在下來自日之國東陸永泉的武士門第
Dialogue: 0,0:16:33.87,0:16:36.09,Default,,0,0,0,,名喚響谷奈奈緒
Dialogue: 0,0:16:36.39,0:16:38.47,Default,,0,0,0,,日之國對吧
Dialogue: 0,0:16:38.78,0:16:41.58,Default,,0,0,0,,在下因機緣巧合來此
Dialogue: 0,0:16:41.58,0:16:45.37,Default,,0,0,0,,大約半年前 在下即將陣亡時
Dialogue: 0,0:16:45.37,0:16:48.29,Default,,0,0,0,,一位路過的魔法師出手相救
Dialogue: 0,0:16:48.60,0:16:51.42,Default,,0,0,0,,在下承蒙那位麥克法蘭閣下的邀請
Dialogue: 0,0:16:51.94,0:16:54.10,Default,,0,0,0,,來到了這裡
Dialogue: 0,0:16:55.37,0:16:57.93,Default,,0,0,0,,你剛才說 那人叫麥克法蘭？
Dialogue: 0,0:16:57.93,0:17:01.35,Default,,0,0,0,,說起來 那人跟雪拉閣下同姓
Dialogue: 0,0:17:02.06,0:17:04.02,Default,,0,0,0,,髮型也很像
Dialogue: 0,0:17:04.02,0:17:07.26,Default,,0,0,0,,那人應該是我父親
Dialogue: 0,0:17:07.26,0:17:10.02,Default,,0,0,0,,他是金伯利的外聘講師
Dialogue: 0,0:17:10.02,0:17:13.73,Default,,0,0,0,,沒想到他竟然去遙遠的東方發掘人才了
Dialogue: 0,0:17:13.73,0:17:17.09,Default,,0,0,0,,你父母不是魔法族吧
Dialogue: 0,0:17:17.36,0:17:19.45,Default,,0,0,0,,那就表示 你跟我一樣 也是通過考試…
Dialogue: 0,0:17:19.45,0:17:22.60,Default,,0,0,0,,不 我並未參加知識測試
Dialogue: 0,0:17:22.60,0:17:27.02,Default,,0,0,0,,應該是我父親用了金伯利教師的特別推薦名額吧
Dialogue: 0,0:17:27.02,0:17:29.27,Default,,0,0,0,,特別推薦名額
Dialogue: 0,0:17:32.38,0:17:34.14,Default,,0,0,0,,總而言之
Dialogue: 0,0:17:34.14,0:17:37.45,Default,,0,0,0,,大家都知道彼此的名字了 咱們開吃吧
Dialogue: 0,0:17:37.45,0:17:38.62,Default,,0,0,0,,是啊
Dialogue: 0,0:17:38.62,0:17:40.89,Default,,0,0,0,,我…我都餓扁了
Dialogue: 0,0:17:40.89,0:17:42.59,Default,,0,0,0,,來 喝吧喝吧
Dialogue: 0,0:17:44.82,0:17:47.04,Default,,0,0,0,,在下也餓了
Dialogue: 0,0:17:47.04,0:17:49.14,Default,,0,0,0,,這是在下那份嗎
Dialogue: 0,0:17:50.37,0:17:51.84,Default,,0,0,0,,你等下 奈奈緒
Dialogue: 0,0:17:51.84,0:17:54.08,Default,,0,0,0,,那是六人份的烤牛肉
Dialogue: 0,0:17:54.93,0:17:58.71,Default,,0,0,0,,您真愛說笑 在下一個人也吃得完
Dialogue: 0,0:17:58.71,0:18:02.60,Default,,0,0,0,,毫無疑問 你不懂這裡的用餐方式
Dialogue: 0,0:18:02.60,0:18:05.91,Default,,0,0,0,,你在位置上坐好 我給你拿吃的
Dialogue: 0,0:18:05.91,0:18:10.32,Default,,0,0,0,,那麼 我來讓你完美掌握餐桌禮儀吧
Dialogue: 0,0:18:13.55,0:18:17.13,Default,,0,0,0,,菜不停端上來 在下就像公主似的
Dialogue: 0,0:18:17.55,0:18:19.27,Default,,0,0,0,,你好像很開心啊
Dialogue: 0,0:18:19.27,0:18:21.53,Default,,0,0,0,,奧利佛 也幫我拿點吧
Dialogue: 0,0:18:21.53,0:18:25.04,Default,,0,0,0,,喂 奧利佛 公主又多了一位哦
Dialogue: 0,0:18:26.97,0:18:28.93,Default,,0,0,0,,順便也幫我拿一下吧
Dialogue: 0,0:18:29.82,0:18:31.65,Default,,0,0,0,,怎麼會變成這樣
Dialogue: 0,0:18:32.02,0:18:33.43,Default,,0,0,0,,受不了
Dialogue: 0,0:18:34.22,0:18:36.78,Default,,0,0,0,,吃飯時就不能安靜點嗎
Dialogue: 0,0:18:37.81,0:18:40.08,Default,,0,0,0,,你的盤子裡全是肉啊
Dialogue: 0,0:18:40.08,0:18:42.89,Default,,0,0,0,,偏食可不好 這盤拿去吃吧
Dialogue: 0,0:18:43.24,0:18:45.36,Default,,0,0,0,,喂 我吃不了蔬菜…
Dialogue: 0,0:18:45.63,0:18:48.56,Default,,0,0,0,,有個人不知道蔬菜有多可貴啊
Dialogue: 0,0:18:48.56,0:18:50.35,Default,,0,0,0,,要跟我熱議一下嗎
Dialogue: 0,0:18:50.35,0:18:52.00,Default,,0,0,0,,熱得我難受
Dialogue: 0,0:18:54.46,0:18:56.96,Default,,0,0,0,,美味 再來一份
Dialogue: 0,0:19:14.73,0:19:18.50,Default,,0,0,0,,想起來了 這裡有擾時精出沒
Dialogue: 0,0:19:22.96,0:19:25.23,Default,,0,0,0,,實際上才剛過五點啊
Dialogue: 0,0:19:31.32,0:19:32.93,Default,,0,0,0,,早上好 皮特
Dialogue: 0,0:19:33.60,0:19:35.42,Default,,0,0,0,,氣消了嗎
Dialogue: 0,0:19:36.49,0:19:38.26,Default,,0,0,0,,跟你住同一間？
Dialogue: 0,0:19:39.03,0:19:42.41,Default,,0,0,0,,你可別大吵大鬧 打擾我看書
Dialogue: 0,0:19:42.74,0:19:46.27,Default,,0,0,0,,今天是上課的第一天 別感冒了
Dialogue: 0,0:19:50.92,0:19:52.98,Default,,0,0,0,,這裡魔素好濃啊
Dialogue: 0,0:19:55.58,0:19:58.91,Default,,0,0,0,,起得真早 有什麼在意的事嗎
Dialogue: 0,0:19:59.50,0:20:03.16,Default,,0,0,0,,我只是想趁著安靜看看校園
Dialogue: 0,0:20:03.51,0:20:04.69,Default,,0,0,0,,你是誰
Dialogue: 0,0:20:04.97,0:20:08.92,Default,,0,0,0,,請放心 我是格溫大人派來的密探
Dialogue: 0,0:20:09.29,0:20:12.70,Default,,0,0,0,,格溫大人吩咐我 在您熟悉這裡前保護您
Dialogue: 0,0:20:13.06,0:20:14.84,Default,,0,0,0,,是表哥幹的啊
Dialogue: 0,0:20:14.84,0:20:16.75,Default,,0,0,0,,特地派個密探也太誇張了
Dialogue: 0,0:20:16.96,0:20:19.32,Default,,0,0,0,,格溫大人是擔心您的安危
Dialogue: 0,0:20:19.32,0:20:20.58,Default,,0,0,0,,我知道
Dialogue: 0,0:20:20.92,0:20:22.46,Default,,0,0,0,,他向來這樣
Dialogue: 0,0:20:22.90,0:20:26.64,Default,,0,0,0,,你會跟著我一段時間吧 我該怎麼稱呼你
Dialogue: 0,0:20:26.64,0:20:27.76,Default,,0,0,0,,隨您稱呼
Dialogue: 0,0:20:27.76,0:20:29.51,Default,,0,0,0,,這才是最讓人頭疼的
Dialogue: 0,0:20:29.51,0:20:31.52,Default,,0,0,0,,乖乖告訴我名字吧
Dialogue: 0,0:20:31.52,0:20:34.15,Default,,0,0,0,,那麼 請叫我特蕾莎·卡斯特吧
Dialogue: 0,0:20:34.15,0:20:36.32,Default,,0,0,0,,明白了 卡斯特小姐
Dialogue: 0,0:20:36.72,0:20:39.32,Default,,0,0,0,,過段時間你會露面的吧
Dialogue: 0,0:20:39.32,0:20:42.49,Default,,0,0,0,,請容我改日再正式拜見您
Dialogue: 0,0:20:42.80,0:20:46.87,Default,,0,0,0,,那麼 有需要請隨時叫我
Dialogue: 0,0:20:56.53,0:20:58.56,Default,,0,0,0,,好涼的清水
Dialogue: 0,0:21:06.26,0:21:08.17,Default,,0,0,0,,這不是奧利佛嗎
Dialogue: 0,0:21:09.40,0:21:11.85,Default,,0,0,0,,你也起得這麼早啊
Dialogue: 0,0:21:14.33,0:21:15.24,Default,,0,0,0,,「穿上遮好」
Dialogue: 0,0:21:22.52,0:21:23.31,Default,,0,0,0,,這是…
Dialogue: 0,0:21:23.31,0:21:25.32,Default,,0,0,0,,你在幹什麼呢
Dialogue: 0,0:21:25.32,0:21:26.88,Default,,0,0,0,,怎麼能在這裡沐浴
Dialogue: 0,0:21:26.88,0:21:29.93,Default,,0,0,0,,雖說是清晨 但男生宿舍也看得很清楚啊
Dialogue: 0,0:21:30.81,0:21:33.22,Default,,0,0,0,,在下又沒幹見不得人的事
Dialogue: 0,0:21:33.22,0:21:35.78,Default,,0,0,0,,你是不在乎 但看到你的人會很為難
Dialogue: 0,0:21:36.12,0:21:39.38,Default,,0,0,0,,而且這不是沐浴 是潔身
Dialogue: 0,0:21:39.38,0:21:41.57,Default,,0,0,0,,在下認為上一場戰鬥染上的血汙
Dialogue: 0,0:21:41.57,0:21:44.14,Default,,0,0,0,,要洗淨才合乎禮儀
Dialogue: 0,0:21:45.88,0:21:47.80,Default,,0,0,0,,你這身傷是？
Dialogue: 0,0:21:48.63,0:21:51.50,Default,,0,0,0,,哦 是在上一場戰鬥受的傷
Dialogue: 0,0:21:51.83,0:21:53.88,Default,,0,0,0,,要是讓你感到不適 實在抱歉
Dialogue: 0,0:21:54.95,0:21:55.79,Default,,0,0,0,,不是的
Dialogue: 0,0:22:06.81,0:22:08.82,Default,,0,0,0,,你可以看著我 諾爾
Dialogue: 0,0:22:08.82,0:22:10.44,Default,,0,0,0,,現在正是時候
Dialogue: 0,0:22:14.15,0:22:15.01,Default,,0,0,0,,那個…
Dialogue: 0,0:22:15.27,0:22:16.80,Default,,0,0,0,,(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:16.80,0:22:20.54,Default,,0,0,0,,那什麼潔身 你還是趕緊完事吧\n(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:20.54,0:22:20.79,Default,,0,0,0,,(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:20.79,0:22:22.39,Default,,0,0,0,,馬上就結束了\n(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:22.39,0:22:23.27,Default,,0,0,0,,(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:23.27,0:22:24.86,Default,,0,0,0,,糟糕 忘記帶擦身子的東西了\n(那時的我 是碌碌無聞的“我”)
Dialogue: 0,0:22:24.86,0:22:25.93,Default,,0,0,0,,糟糕 忘記帶擦身子的東西了\n(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:25.93,0:22:26.92,Default,,0,0,0,,用這個擦吧\n(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:26.92,0:22:27.70,Default,,0,0,0,,(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:27.70,0:22:28.61,Default,,0,0,0,,這不合適吧\n(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:28.61,0:22:29.80,Default,,0,0,0,,別說了\n(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:29.80,0:22:31.52,Default,,0,0,0,,(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:31.52,0:22:33.90,Default,,0,0,0,,那在下就不客氣了\n(被無償的愛和溫暖保護著)
Dialogue: 0,0:22:33.90,0:22:34.01,Default,,0,0,0,,那在下就不客氣了
Dialogue: 0,0:22:35.20,0:22:35.47,Default,,0,0,0,,這下就欠你一個大人情了 奧利佛
Dialogue: 0,0:22:35.47,0:22:38.55,Default,,0,0,0,,這下就欠你一個大人情了 奧利佛\n(轉瞬即逝的時間殘酷無情)
Dialogue: 0,0:22:38.55,0:22:40.17,Default,,0,0,0,,(轉瞬即逝的時間殘酷無情)
Dialogue: 0,0:22:40.17,0:22:41.36,Default,,0,0,0,,奈奈緒·響谷\n(轉瞬即逝的時間殘酷無情)
Dialogue: 0,0:22:41.36,0:22:41.63,Default,,0,0,0,,奈奈緒·響谷\n(帶走了我心愛的你)
Dialogue: 0,0:22:41.63,0:22:42.41,Default,,0,0,0,,(帶走了我心愛的你)
Dialogue: 0,0:22:42.41,0:22:44.66,Default,,0,0,0,,我在金伯利魔法學校\n(帶走了我心愛的你)
Dialogue: 0,0:22:44.66,0:22:44.97,Default,,0,0,0,,(帶走了我心愛的你)
Dialogue: 0,0:22:44.97,0:22:45.96,Default,,0,0,0,,遇見了這位天真無邪的古怪少女\n(帶走了我心愛的你)
Dialogue: 0,0:22:45.96,0:22:47.01,Default,,0,0,0,,遇見了這位天真無邪的古怪少女\n(我那小小的手 實在是捧不下)
Dialogue: 0,0:22:47.01,0:22:48.00,Default,,0,0,0,,(我那小小的手 實在是捧不下)
Dialogue: 0,0:22:48.00,0:22:49.65,Default,,0,0,0,,但是她身上\n(我那小小的手 實在是捧不下)
Dialogue: 0,0:22:49.65,0:22:50.11,Default,,0,0,0,,(我那小小的手 實在是捧不下)
Dialogue: 0,0:22:50.11,0:22:51.47,Default,,0,0,0,,有一股微弱的 抹不掉的…\n(我那小小的手 實在是捧不下)
Dialogue: 0,0:22:51.47,0:22:53.06,Default,,0,0,0,,有一股微弱的 抹不掉的…\n(留下悔恨)
Dialogue: 0,0:22:53.06,0:22:53.61,Default,,0,0,0,,(留下悔恨)
Dialogue: 0,0:22:53.61,0:22:55.31,Default,,0,0,0,,血腥味\n(留下悔恨)
Dialogue: 0,0:22:55.31,0:22:56.71,Default,,0,0,0,,(留下悔恨)
Dialogue: 0,0:22:56.95,0:22:57.01,Default,,0,0,0,,(第一集 開學典禮)
Dialogue: 0,0:22:57.01,0:22:59.32,Default,,0,0,0,,(第一集 開學典禮)\n(咚…咚…孤獨)
Dialogue: 0,0:22:59.32,0:23:02.00,Default,,0,0,0,,(第一集 開學典禮)\n(心臟只是反覆跳動)
Dialogue: 0,0:23:02.00,0:23:03.87,Default,,0,0,0,,(心臟只是反覆跳動)
Dialogue: 0,0:23:03.87,0:23:06.76,Default,,0,0,0,,(不知不覺間)
Dialogue: 0,0:23:06.76,0:23:12.00,Default,,0,0,0,,(憤怒如怪物般吞噬心靈)
Dialogue: 0,0:23:12.00,0:23:17.20,Default,,0,0,0,,(將我變成了陌生的人)
Dialogue: 0,0:23:17.20,0:23:25.54,Default,,0,0,0,,(那天被愛著的“我” 已不復存在)
Dialogue: 0,0:23:36.41,0:23:39.95,Default,,0,0,0,,(下集 魔法劍)
`
	)
	var ass_lines []string
	for line := range bytes.SplitSeq(utils.SRT2ASS([]byte(srt), []string{}), []byte("\n")) {
		if len(line) != 0 {
			ass_lines = append(ass_lines, string(line))
		}
	}
	var python_ass_line []string
	for line := range strings.SplitSeq(python_ass, "\n") {
		if line != "" {
			python_ass_line = append(python_ass_line, line)
		}
	}
	for inedx, line := range ass_lines {
		if line != python_ass_line[inedx] {
			t.Errorf("解析有差异：\nGo：\t%s\nPython：\t%s\n", line, python_ass_line[inedx])
		}
	}
}
